tests/Performance/K6/resultado.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 

     execution: local
        script: test.js
        output: -

     scenarios: (100.00%) 1 scenario, 1 max VUs, 5h0m30s max duration (incl. graceful stop):
              * default: 1 iterations shared among 1 VUs (maxDuration: 5h0m0s, gracefulStop: 30s)



  █ TOTAL RESULTS 

    checks_total.......................: 2      120.66365/s
    checks_succeeded...................: 50.00% 1 out of 2
    checks_failed......................: 50.00% 1 out of 2

    ✓ status is 200
    ✗ resposta tem sucesso
      ↳  0% — ✓ 0 / ✗ 1

    CUSTOM
    order_counter...........................................................: 1     60.331825/s

    HTTP
    http_req_duration.......................................................: avg=8.02ms  min=8.02ms  med=8.02ms  max=8.02ms  p(90)=8.02ms  p(95)=8.02ms 
      { expected_response:true }............................................: avg=8.02ms  min=8.02ms  med=8.02ms  max=8.02ms  p(90)=8.02ms  p(95)=8.02ms 
    http_req_failed.........................................................: 0.00% 0 out of 1
    http_reqs...............................................................: 1     60.331825/s

    EXECUTION
    iteration_duration......................................................: avg=16.05ms min=16.05ms med=16.05ms max=16.05ms p(90)=16.05ms p(95)=16.05ms
    iterations..............................................................: 1     60.331825/s

    NETWORK
    data_received...........................................................: 532 B 32 kB/s
    data_sent...............................................................: 354 B 21 kB/s



running (0h00m00.0s), 0/1 VUs, 1 complete and 0 interrupted iterations
default ✓ [ 100% ] 1 VUs  0h00m00.0s/5h0m0s  1/1 shared iters